Revit 2027 API
BentFabricBendDirection Enumeration
 Direction in which FabricSheet is bent.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BentFabricBendDirection
Public Enumeration BentFabricBendDirection
public enum class BentFabricBendDirection
type BentFabricBendDirection
Members
Member name | Value | Description
Major | 0 |  FabricSheet is bent along major direction axis.
Minor | 1 |  FabricSheet is bent along minor direction axis.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace